in-memoriam-aaron-swartz.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>In Memoriam Aaron Swartz</title>
<!-- 2014-12-31 Wed 19:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="hellekin" />
</head>
<body>
<div id="content">
<h1 class="title">In Memoriam Aaron Swartz</h1>
<p>
One year ago, on January 11th, 2013, a young hacker dedicated to the
advancement of freedom, knowledge, and convinced of the power of
individuals and collectives to bring forth humane values for a more
egalitarian world, decided that he could not win the legitimate
struggle he had been fighting for since he was a child, and chose to
remove himself from our world, to comply with the corrupt order that
suppresses life where it flourishes, and punishes the just for wishing
to abide by the Constitution and general interest rather than the rule
of the powerful criminal few and their particular interests.
</p>

<p>
His shock at being excruciated for liberating knowledge that should be
public given the sources of its funding, and the purpose of its
creation, and to be persecuted for doing what is right according to
the spirit of his own country, and the narrative of the so-called free
world, cornered him into a dead end. It came as a hard deadline for
many of us, especially those close to him, for they knew the human
becoming that he was, where most of us could only recognize his genius
through his inspiring words and actions.
</p>

<p>
With his life, Aaron Swartz took for shroud the veil of the illusion
of the free world's narrative. Along with other suppressed freedom
fighters, Julian Assange, Barret Brown, Chelsea Manning, Edward
Snowden, etc., he contributed to demonstrate that however hard we want
to think about freedom, democracy, humanity, we're not there anymore:
that path and dream were stolen from us and we're like insects
following a light in the dark, taking it for the Sun, only to discover
when it's too late, that we've been lured into a death trap.
</p>

<p>
Repeating "I knew, I knew" won't do it this time. It's time to recover
from the shock, and plant a new path, a new dreamscape, and that must
be one of caring and sharing, one of humane and human spirit and
community, and a path that can only be taken one by one, by each of
us, to become the drops that will grow into a rain and wash away the
nightmare that paranoid punishers want to impose on us. Whatever their
narrative, we all know their ethics do not match their words, however
beautiful and inspiring they can be: their time is done, as much as
the time of kings and awe-inspired rulers was half-a-millenium
ago. Our narrative must be complex, multiple, planetary, far-seeing,
and will impose itself by the numbers, and not by force.
</p>

<p>
Hackers can only act so far as to constrain the technology to embed
this ethics and this dreamscape into code, and choose to orient the
politics of the technique towards personal empowerment, and collective
freedom. There's no technological solution to mental slavery, but
indeed there's a tension built-in the tools we make, that can help
anyone to make choices for themselves and the rest of us.
</p>

<p>
If the Nasty Stooges of America founded their cosmogony on George
Orwell's 1984, we must stick to our fundamentals, and see how the
military machine of the Listeners has in the 20th Century been
subverted, appropriated, and expanded by the likes of Alan Turing,
Alan Kay, Douglas Engelbart, John C. Licklider, and many more to build
the Internet, this revolutionary expansion of the individual mind,
into a reflection of a collective mind, and an enabler of collective
intelligence that is revealing the complexity of our social agency.
</p>

<p>
We must use it as a tool not to build more technology, that most of it
would be qualified by Ted Nelson as "packaging", but to bring
ourselves together into solving the most pressing and global
challenges that humanity has been facing in its recorded history:
world hunger, unleashing of fanaticisms, proliferation of nuclear
weapons, degradation of the biosphere<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>, etc. for humanity to succeed
despite the obvious will or suicidal panic of a few.
</p>

<p>
This is an omni-directional endeavor of unprecedented proportions and
not one single individual can understand all the keys to make it
happen&#x2013;neither will any single non-human institution such as a
nation-state nor a corporation. But together, given the right
narrative, the will to succeed, the tools to facilitate our will, and
the tools to make it difficult and fastidious to oppose us, we shall
prevail<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<p>
Nobody should be able to cut the wings of another Aaron Swartz, and
the Aaron Swartz that still lives in each of us should be another
shield against arbitrary, uninformed, fanatic, cruel, and idiotic
decisions that wish to punish instead of educating. When society turns
against its own subjects, we can diagnose metastasis. It's time for a
cure.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
In the words of Edgard Morin
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
In the purity of essence of all our precious bodily fluids.
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: Sat, 11 Jan 2014 13:09:58 -0300</p>
<p class="author">Author: hellekin</p>
<p class="date">Created: 2014-12-31 Wed 19:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
